from lib.turing_machines import SingleTapeTuringMachine

tm = SingleTapeTuringMachine(
    # >=11, 0=01, 1=10, -=00でコーディング
    # つまり、">0110-0011-"がバイナリコーディングされている
    # 停止状態では">1001-0000-"を期待する
    # バイナリだと"1110010110000101010100"
    tape="1101101001000101101000",
    alphabets=["0", "1"],
    states=[
        "qi",
        "qv",
        "q1",
        "q1r0",
        "q1r1",
        "q2",
        "q2r0",
        "q2r1",
        "q3",
        "q3r0",
        "q3r1",
        "qder",
        "qde",
        "qder0",
        "qder1",
        "qini",
        "qinir0",
        "qinir1",
        "qin",
        "qinr0",
        "qinr1",
        "qrei",
        "qreir0",
        "qreir1",
        "qf",
        "qfr0",
        "qfr1",
        "qfre",
        "qh",
    ],
    initial_state="qi",
    halt_state="qh",
    program=[
        # 終端文字読み込み
        ("qi", "1", "qv", "1", 1),
        ("qv", "1", "q1", "1", 1),
        # 第1引数を飛ばす
        ("q1", "0", "q1r0", "0", 1),
        ("q1", "1", "q1r1", "1", 1),
        ("q1r0", "0", "q2", "0", 1),
        ("q1r0", "1", "q1", "1", 1),
        ("q1r1", "0", "q1", "0", 1),
        ("q1r1", "1", "q1", "1", 1),
        # 第2引数の第1位まで移動およびチェック
        ("q2", "0", "q2r0", "0", 1),
        ("q2", "1", "q3r1", "1", 1),
        ("q3", "0", "q3r0", "0", 1),
        ("q3", "1", "q3r1", "1", 1),
        ("q2r0", "1", "q2", "1", 1),
        ("q2r0", "0", "qf", "0", 0),
        ("q3r0", "0", "qder", "0", -1),
        ("q3r0", "1", "q3", "1", 1),
        ("q3r1", "0", "q3", "0", 1),
        ("q3r1", "1", "q3", "1", 1),
        ("qder", "0", "qde", "0", -1),
        # 第2引数をデクリメント
        ("qde", "0", "qder1", "1", -1),
        ("qde", "1", "qder0", "0", -1),
        ("qder1", "1", "qini", "0", -1),
        ("qder0", "0", "qde", "1", -1),
        ("qini", "0", "qinir0", "0", -1),
        ("qini", "1", "qinir1", "1", -1),
        ("qinir0", "1", "qini", "1", -1),
        ("qinir1", "0", "qini", "0", -1),
        ("qinir0", "0", "qin", "0", -1),
        # 第1引数をインクリメント
        ("qin", "0", "qinr1", "1", -1),
        ("qin", "1", "qinr0", "0", -1),
        ("qinr1", "1", "qin", "0", -1),
        ("qinr0", "0", "qrei", "1", -1),
        ("qrei", "0", "qreir0", "0", -1),
        ("qrei", "1", "qreir1", "1", -1),
        ("qreir0", "1", "qrei", "1", -1),
        ("qreir1", "0", "qrei", "0", -1),
        ("qreir1", "1", "qi", "1", 0),
        # ファイナライズ
        ("qf", "0", "qfr0", "0", -1),
        ("qf", "1", "qfr1", "1", -1),
        ("qfr0", "0", "qf", "0", -1),
        ("qfr0", "1", "qf", "1", -1),
        ("qfr1", "0", "qf", "0", -1),
        ("qfr1", "1", "qfre", "1", 1),
        ("qfre", "1", "qh", "1", 1),
    ],
)

tm.validate()
tm.execute()
